Revit 2027 API
KeyBasedTreeEntriesLoadResults.GetFileReadErrors Method
 Gets the names of any files which could not be read due to access errors.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<string> GetFileReadErrors()
Public Function GetFileReadErrors As IList(Of String)
public:
IList<String^>^ GetFileReadErrors()
member GetFileReadErrors : unit -> IList<string>
Return Value
IList<String>
 An array of strings containing the filenames of files which could not be read.
Remarks
 Only applies to KeyBasedTreeEntries built from text files.
See Also
Reference
KeyBasedTreeEntriesLoadResults Class
Autodesk.Revit.DB Namespace